<template lang="pug">
.flex.flex-col

  .group Мудрость
  .row
    .title Креативность
    .text Творческие люди оригинальны, они придумывают новые способы сделать что-то. В то же время, эти вещи также применимы. Ерунда может быть уникальной, но она креативна, только если ее можно использовать.
  .row
    .title Любопытство
    .text Любопытные люди постоянно ищут новые впечатления, идеи и мероприятия. Они делают все, чтобы увеличить свои знания.
  .row
    .title Вердикт
    .text Люди с здравым смыслом могут мыслить критически, анализировать и делать логические выводы. Они взвешивают разные точки и не слишком быстро готовят свое мнение.
  .row
    .title Любовь к учебе
    .text Люди с любовью к учебе хотят расширить свои знания. Эта добродетель отличается от любопытства, потому что она включает в себя более глубокие знания. Вы не можете просто упасть с энтузиазмом, вы должны подумать об основах своего знания.
  .row
    .title Перспективы
    .text Люди с перспективой видят общую картину. Они могут поставить проблемы в перспективе и дать событиям место в жизни. Их часто просят совета.

  .group Мужество
  .row
    .title Храбрость
    .text Храбрость означает противостояние вашим страхам. Это может быть физическое (насилие), психологическое (общение с аудиторией) или моральное (отстаивание кого-либо). Храбрый человек бросает вызов опасности, если это необходимо.
  .row
    .title Усидчивость
    .text Собиратели денег не экономят усилий для выполнения задачи и поддерживают ее в течение более длительного периода времени. Разочарования, отвлечения и разочарования преодолены.
  .row
    .title Честность
    .text Честные люди верны своим чувствам и принципам по отношению к себе и к другим. Они искренни и несут ответственность за свои действия.
  .row
    .title Жизнеспособность
    .text Жизненно важные люди полны энергии и энтузиазма. Они живут счастливо и от всего сердца решают задачи.

  .group Человечность
  .row
    .title Любовь
    .text Любящие люди ценят близкие отношения. В самых интимных отношениях они могут обеспечить тепло и близость.
  .row
    .title Доброта
    .text Доброта означает быть добрым к другим, проявлять сострадание и иметь сочувствие. Дружелюбные люди очень вовлечены в благосостояние других и альтруистичны.
  .row
    .title Социальный интеллект
    .text Люди с высоким социальным интеллектом знают, как работают люди. Они знают потребности других и самих себя, а затем могут ответить на них.

  .group Праведность
  .row
    .title Работа в команде
    .text Командная работа как добродетель означает, что вы заботитесь о целях группы и хотите посвятить себя этому. Кто-то с этой добродетелью лоялен, ценит групповые чувства и вносит свой вклад в общество.
  .row
    .title Справедливость
    .text Справедливый человек заботится о моральных принципах. Она умеет сопереживать другим и не пытается опередить себя и своих друзей. Она хочет относиться ко всем справедливо.
  .row
    .title Руководство
    .text Лидеры могут организовывать группы и поддерживать их работу. Они могут ставить цели и мотивировать других.

  .group Умеренность
  .row
    .title Прощение
    .text Прощение - это способность понимать и принимать ошибки и недостатки других и давать другим второй шанс. Люди с этой добродетелью могут оставить за собой неприятные события.
  .row
    .title Покорность
    .text Смиренные люди не нуждаются в чрезмерном интересе или внимании. Они знают, чего они стоят, но признают дополнения других и свои недостатки.
  .row
    .title Осторожность
    .text Осторожные люди не идут на ненужные риски и умеют строить планы. Они думают о последствиях, прежде чем что-то сделать.
  .row
    .title Саморегулирование
    .text Саморегуляция - это способность контролировать эмоции, чтобы направлять их гармоничным или продуктивным образом. Вы можете думать о контроле гнева, страха или неуверенности.

  .group Превосходство
  .row
    .title Оценка прекрасного
    .text Люди с этой добродетелью чувствительны к красивым и изысканным вещам. На них быстро влияют добродетели других, и они трепетно ​​относятся к навыкам.
  .row
    .title Благодарность
    .text Благодарные люди чувствуют себя благословенными жизнью и окружающими. Они благодарны другим людям за их усилия и рады выразить эту благодарность.
  .row
    .title Надежда
    .text Надеющиеся люди верят, что могут достичь своих целей. Они имеют позитивный взгляд на будущее и объясняют неудачи, основанные на меняющихся обстоятельствах.
  .row
    .title Игривость / Юмор
    .text Игривые люди видят менее серьезную сторону жизни. Они могут развлечь людей поведением, которое не является необходимым для достижения цели.
  .row
    .title Духовность
    .text уховность - это чувство обладания высшей целью. Духовные люди находятся в контакте со священным (может быть и светским) и воспринимают жизнь как значимую.
</template>

<script setup>

</script>

<style lang="postcss" scoped>
.row {
  @apply flex flex-wrap mb-6 p-2 shadow-md;
  background-color: hsla(0, 0%,50%,0.05);
}
.group {
  @apply text-2xl font-bold mt-8 mb-4;
  grid-column: span 2;
}

.title {
  @apply p-4 flex-0 font-bold w-full sm:w-150px;
}

.text {
  @apply p-4 flex-1;
}

</style>