<template lang="pug">
.max-w-full.max-h-2xl.overflow-x-scroll
  table
    tbody
      tr.text-center
        th Картина мира (травма)

        td(:colspan="4") 
          strong Я и мир 
          span (привязанность)
        td
        td(:colspan="4") 
          strong Мы и они 
          span (потеря)
        td
        td(:colspan="4") 
          strong Я и ты  
          span (системные отношения)

      tr.font-bold.text-2xl
        th Иконка

        td 👀
        td 👑
        td 💫
        td 🏺
        td
        td 🧰
        td 📇
        td 🛍 
        td 🛎
        td
        td 🛸
        td 🚀
        td ✊
        td 💎

      tr.font-bold.text-lg.sticky.top-0.z-2
        th Название

        td.bg-light-blue-300(class="dark:bg-blue-900") Наблюдатель
        td.bg-pink-300(class="dark:bg-pink-900") Властелин
        td.bg-amber-300(class="dark:bg-amber-900")  Звезда
        td.bg-green-300(class="dark:bg-green-900") Эстет
        td
        td.bg-light-blue-200(class="dark:bg-blue-800")  Хозяин
        td.bg-pink-200(class="dark:bg-pink-800") Законодатель
        td.bg-amber-200(class="dark:bg-amber-800")  Принц
        td.bg-green-200(class="dark:bg-green-800") Служитель
        td
        td.bg-light-blue-100(class="dark:bg-blue-700")  Детектив
        td.bg-pink-100(class="dark:bg-pink-700") Идеолог
        td.bg-amber-100(class="dark:bg-amber-700") Революционер
        td.bg-green-100(class="dark:bg-green-700") Философ

      tr.font-bold
        th Психотип

        td Аутичный
        td Психопатичный
        td Истероидный
        td Эпилептоидный
        td
        td Компульсивный
        td Маниакальный
        td Нарциссический
        td Депрессивный
        td
        td Параноидальный
        td Шизоидный
        td Симбиотический
        td Избегающий


      tr
        th Базовая потребность

        td Проявление, внешний раздражитель
        td Ограничения, тайная внутренняя жизнь
        td Выделение главного, конкретизация
        td Интерес, однозначный результат
        td
        td Следование своим желаниям
        td Опека себя, возможность просить
        td Личные связи, благодетельство
        td Признание заслуг
        td
        td Эксклюзивность, определенность
        td Долг, реалистичность
        td Договоренности, опоры
        td Востребованность, целостность

      tr
        th Невротическая потребность

        td Контроль
        td Власть
        td Игра
        td Самопожертвование
        td
        td Ограничение
        td Правота
        td Признание
        td Одобрение
        td
        td Независимость
        td Гордость
        td Вдохновение
        td Завершенность
      tr
        th Страх
        td Жизни
        td Смерти
        td Потери
        td Неизбежности
        td
        td Потери контроля
        td Неизвестности
        td Падения
        td Наказания
        td
        td Близости
        td Потери себя
        td Зависти
        td Несостоятельности

      tr
        th Роль в социуме

        td Знает и хранит факты
        td Проверяет, раскачивает социум
        td Проверяет моральные устои, провоцирует общество
        td Хранит духовные традиции
        td
        td Проверяет систему, законы
        td Создает законы, ставит задачи
        td Создает культурные стандарты
        td Душа и совесть социума
        td
        td Проверяет безопасность социума
        td Первооткрыватель, генератор идей
        td Разведка, продвижение идей
        td Философия мироздания

      tr
        th Дар

        td Окружающие чувствуют и удовлетворяют вытесненные потребности
        td Мотивация, эффективность
        td Умение быстро входить в контакт
        td Соединение земного с высоким
        td
        td Исполнительность, неутомимость, четкость
        td Сила, организаторские способности
        td Коммуникабельность, хороший вкус
        td Добротолюбие, милосердие, большое сердце
        td
        td Глубокий инсайт, способность смотреть в глубину
        td Независимость, фантазия, способность к трансформации
        td Умение вдохновлять, тонкое чувство справедливости
        td Способность понимать всех, чувство баланса и гармонии
</template>

<script setup>

</script>

<style lang="postcss" scoped>
th {
  @apply sticky left-0 text-right font-bold bg-white text-sm dark:bg-warm-gray-700;
}
tr:nth-child(2n) th {
  @apply bg-gray-50 dark:bg-warm-gray-600;
}
</style>