<template lang="pug">
.grid.grid-cols-2.gap-4
  .cell.bg-pink-100(class="dark:bg-pink-800")
    h4 Сангвиник
    h5 Активный интроверт
    p Реализует свои желания, преодолевает препятствия, достигает цели. Игнорирует чужую точку зрения и смену отбстоятельств.
  .cell.bg-amber-100(class="dark:bg-amber-800") 
    h4 Холерик
    h5 Активный экстраверт
    p Стремится находиться в центре внимания поклонников. Харизматичен, коммуникабелен, не терпит критики.
  .cell.bg-light-blue-100(class="dark:bg-blue-800") 
    h4 Флегматик
    h5 Пассивный интроверт
    p Боится потерять то, что имеет. Стремится к спокойствию, стабильности. Самостоятелен. Автономен. Сам себе на уме.
  .cell.bg-green-100(class="dark:bg-green-800")
    h4 Меланхолик
    h5 Пассивный экстраверт
    p Следует за авторитетом и лидером. Склонен к самопожертвованию. Вдумчивый, внимательный, поддерживающий.
  
</template>

<script setup>

</script>

<style lang="stylus" scoped>
.cell
  @apply p-6 shadow rounded

  h4
    @apply mt-2 mb-4 text-xl

  h5
    @apply mb-2

  p
    @apply text-lg m-0
</style>