<template lang="pug">
.flex.flex-col

  .group Мудрость
  .row 
    .title(:style="levelColor(0, 24)")
      .icon
        la-palette
      .text Креативность
    .text Творческие люди оригинальны, они придумывают новые способы делать что-то. В то же время, результаты такое деятельности оказываются применимы. Ерунда может быть уникальной, но она креативна, только если ее можно использовать.
  .row
    .title(:style="levelColor(1, 24)")
      .icon
        la-search
      .text Любопытство
    .text Любопытные люди постоянно ищут новые впечатления, идеи и события. Они делают все, чтобы увеличить свои знания.
  .row
    .title(:style="levelColor(2, 24)") 
      .icon
        la-layer-group
      .text Открытость ума
    .text Люди с открытым умом могут мыслить критически, анализировать и делать логические выводы. Они взвешивают разные точки и не слишком быстро готовят свое мнение.
  .row
    .title(:style="levelColor(3, 24)") 
      .icon
        la-book-open
      .text Любовь к учебе
    .text Люди с любовью к учебе хотят расширить свои знания. Эта добродетель отличается от любопытства, потому что она включает в себя более глубокие знания. Вы не можете погружаться в тему на голом энтузиазме, вы должны подумать об основах своего знания.
  .row
    .title(:style="levelColor(4, 24)") 
      .icon
        la-eye
      .text Перспектива
    .text Люди с перспективой видят общую картину. Они могут увидеть проблему с разных сторон и дать событиям место в жизни. Их часто просят совета.

  .group Мужество

  .row
    .title(:style="levelColor(5, 24)") 
      .icon
        la-star
      .text Храбрость
    .text Храбрость означает противостояние вашим страхам. Это может быть физическое (насилие), психологическое (общение с аудиторией) или моральное (отстаивание кого-либо). Храбрый человек бросает вызов опасности, если это необходимо.
  .row 
    .title(:style="levelColor(6, 24)") 
      .icon
        la-chess-rook
      .text Усидчивость
    .text Усидчивый человек не экономит усилий для выполнения задачи и может выполнять ее в течение более длительного времени. Отвлечения и разочарования преодолимы.
  .row 
    .title(:style="levelColor(7, 24)") 
      .icon
        la-hand-paper
      .text Честность
    .text Честные люди верны своим чувствам и принципам по отношению к себе и к другим. Они искренни и несут ответственность за свои действия.
  .row 
    .title(:style="levelColor(8, 24)") 
      .icon
        la-sun
      .text Воодушевленность
    .text Живые люди полны энергии и энтузиазма. Они живут счастливо и от всего сердца решают задачи.

  .group Человечность
  .row 
    .title(:style="levelColor(9, 24)") 
      .icon
        la-heart
      .text Любовь
    .text Любящие люди ценят близкие отношения. В самых интимных отношениях они могут обеспечить тепло и близость.
  .row 
    .title(:style="levelColor(10, 24)") 
      .icon
        la-hand-holding-heart
      .text Доброта
    .text Доброта означает быть добрым к другим, проявлять сострадание и иметь сочувствие. Дружелюбные люди очень вовлечены в благосостояние других и альтруистичны.
  .row 
    .title(:style="levelColor(11, 24)") 
      .icon
        la-hands-helping
      .text Социальный интеллект
    .text Люди с высоким социальным интеллектом знают, как работают люди. Они знают потребности других и самих себя, а потому могут на них ответить.

  .group Праведность
  .row 
    .title(:style="levelColor(12, 24)") 
      .icon
        la-people-carry
      .text Работа в команде
    .text Командная работа как добродетель означает, что вы заботитесь о целях группы и хотите посвятить себя этому. Кто-то с этой добродетелью лоялен, ценит групповые чувства и вносит свой вклад в общество.
  .row 
    .title(:style="levelColor(13, 24)") 
      .icon
        la-landmark
      .text Справедливость
    .text Справедливый человек заботится о моральных принципах. Он умеет сопереживать другим и не пытается опередить себя и своих друзей. Он хочет относиться ко всем справедливо.
  .row 
    .title(:style="levelColor(14, 24)") 
      .icon
        la-chess-queen
      .text Руководство
    .text Лидеры могут организовывать группы и поддерживать их работу. Они могут ставить цели и мотивировать других.

  .group Умеренность
  .row 
    .title(:style="levelColor(15, 24)") 
      .icon
        la-hand-peace
      .text Прощение
    .text Способность понимать и принимать ошибки и недостатки других и давать другим второй шанс. Люди с этой добродетелью могут оставить неприятные события позади.
  .row 
    .title(:style="levelColor(16, 24)") 
      .icon
        la-chess-pawn
      .text Покорность
    .text Смиренные люди не нуждаются в чрезмерном интересе или внимании. Они знают, чего они стоят, но признают превосходство других и свои недостатки.
  .row 
    .title(:style="levelColor(17, 24)") 
      .icon
        la-life-ring
      .text Осторожность
    .text Осторожные люди не идут на ненужные риски и умеют строить планы. Они думают о последствиях, прежде чем что-то сделать.
  .row 
    .title(:style="levelColor(18, 24)") 
      .icon
        la-traffic-light
      .text Саморегулирование
    .text Саморегуляция - это способность контролировать эмоции, чтобы направлять их гармоничным или продуктивным образом. Вы можете думать о контроле гнева, страха или неуверенности.

  .group Превосходство
  .row 
    .title(:style="levelColor(19, 24)") 
      .icon
        la-seedling
      .text Оценка прекрасного
    .text Люди с этой добродетелью чувствительны к красивым и изысканным вещам. На них быстро влияют добродетели других, и они трепетно ​​относятся к навыкам.
  .row 
    .title(:style="levelColor(20, 24)") 
      .icon
        la-gifts
      .text Благодарность
    .text Благодарные люди чувствуют себя благословенными жизнью и окружающими. Они благодарны другим людям за их усилия и рады выразить эту благодарность.
  .row 
    .title(:style="levelColor(21, 24)") 
      .icon
        la-hand-pointer
      .text Надежда
    .text Надеющиеся люди верят, что могут достичь своих целей. Они имеют позитивный взгляд на будущее и объясняют неудачи, основанные на меняющихся обстоятельствах.
  .row 
    .title(:style="levelColor(22, 24)") 
      .icon
        la-laugh
      .text Игривость
    .text Юмор. Игривые люди видят менее серьезную сторону жизни. Они могут развлечь людей поведением, которое не является необходимым для достижения цели.
  .row 
    .title(:style="levelColor(23, 24)") 
      .icon
        la-praying-hands
      .text Духовность
    .text Духовность - это чувство обладания высшей целью. Духовные люди находятся в контакте со священным (может быть и светским) и воспринимают жизнь как значимую.
</template>

<script setup>

function levelColor(
  i = 0,
  n = 3,
  reverse = false,
  s = '50%',
  l = '50%',
  a = '0.5'
) {
  if (reverse) {
    i = n - i - 1
  }
  return {
    backgroundColor: `hsla(${i * (360 / n)}, ${s}, ${l}, ${a})`
  }
}

</script>

<style scoped>
.row {
  background-color: hsla(0, 0%, 50%, 0.05);
  @apply flex flex-wrap mb-6 shadow-md transition hover:shadow-lg;
}
.group {
  @apply text-2xl font-bold mt-8 mb-4;
  grid-column: span 2;
}

.title {
  @apply text-lg p-4 flex-0 flex flex-col items-center content-center text-center font-bold w-full sm:w-170px;
}

.icon {
  @apply text-4xl text-center;
}

.text {
  @apply p-4 flex-1;
}
</style>