<template lang="pug">
.table

  .stage.text-lg.bg-gray-500.bg-opacity-20 Этап
  .desc.text-lg.bg-gray-500.bg-opacity-20 Формирование каких структур происходит

  .stage.bg-ch-12-0(class="dark-bg-ch-12-0d") 
    .title Имидж
    .age 0–3 года
  .desc Телесные границы и представление ребенка о том, что он — отдельное существо, имеющее имя и какие-то внешние характеристики

  .stage.bg-ch-12-1(class="dark-bg-ch-12-1d") 
    .title Экономика
    .age 3—6 лет
  .desc Предметная деятельность и представление ребенка о личной собственности, о принадлежности ему вещей

  .stage.bg-ch-12-2(class="dark-bg-ch-12-2d") 
    .title Учеба
    .age 6—9 лет
  .desc Навыки обучения: чтения, письма, а главное — отношения к процессу учебы

  .stage.bg-ch-12-3(class="dark-bg-ch-12-3d") 
    .title Семья
    .age 9—12 лет
  .desc Оценочное отношение к родителям, к своему социальному классу и национальности, самоидентификация как члена рода и традиции

  .stage.bg-ch-12-4(class="dark-bg-ch-12-4d") 
    .title Искусство
    .age 12—15 лет
  .desc Индивидуальные творческие способности, креативное мышление, восприятие искусства

  .stage.bg-ch-12-5(class="dark-bg-ch-12-5d") 
    .title Здоровье
    .age 15—18 лет
  .desc Сознательное отношение к своему здоровью, ответственность за состояние и вид своего тела

  .stage.bg-ch-12-6(class="dark-bg-ch-12-6d") 
    .title Любовь
    .age 18—21 год
  .desc Способность к любви, разделение идентификации и эмпатии, субъектное отношение к любимому объекту

  .stage.bg-ch-12-7(class="dark-bg-ch-12-7d") 
    .title Секс
    .age 21—24 года
  .desc Главные сексуальные навыки (партнерские), саморефлексия в этой сфере, сексуальная самоидентификация, осознаются особые склонности

  .stage.bg-ch-12-8(class="dark-bg-ch-12-8d") 
    .title Альтруизм
    .age 24—27 лет
  .desc Осознанная потребность в самопожертвовании, сострадании, сочувствии, принадлежности ко всему человечеству

  .stage.bg-ch-12-9(class="dark-bg-ch-12-9d") 
    .title Работа
    .age 27—30 лет
  .desc Профессиональная самоидентификация, определяется место в социуме, карьерные амбиции и планки

  .stage.bg-ch-12-10(class="dark-bg-ch-12-10d") 
    .title Дружба
    .age 30—33 лет
  .desc Круг родственных по духу людей и идейная основа для связи с единомышленниками

  .stage.bg-ch-12-11(class="dark-bg-ch-12-11d") 
    .title Транс
    .age 33—36 лет
  .desc Восприятие трансцендентного, отношения к жизни-смерти, появляются рычаги зрелого эмоционального контроля

</template>

<script setup>

</script>

<style lang="postcss" scoped>
.table {
  display: grid;
  grid-template-columns: minmax(120px, 1fr) 3fr;
  align-items: center;
}

.stage {
  @apply p-4;
}

.age {
  @apply pt-4;
}

.title {
  @apply font-bold text-lg;
}

.desc {
  @apply p-4 justify-center items-center;
}
</style>

